espruino/Espruino/targets/esp32/IDF5/sdkconfig.defaults.esp32
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.3 Project Minimal Configuration
#
## add the needed changes 
# cd bin 
# idf.py menuconfig  
## create list of changes 
# idf.py save-defconfig
## add contend of sdkconfig.default to this file
#
CONFIG_IDF_TARGET_ESP32=y
CONFIG_IDF_TARGET="esp32"
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y 
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
